org-mode/posts.org
#+hugo_base_dir: ../
#+hugo_section: posts
#+OPTIONS: toc:2

    
** Tools that are Best! :cli:linux:minimal:tools:
   :PROPERTIES:
   :EXPORT_FILE_NAME: tools-readme
   :EXPORT_DATE: 2022-03-28
   :EXPORT_HUGO_DRAFT: false
   :END:

--------------

*** Utilities that are Best! ðŸŒŸ
--------------

|-------------------------+-------------------------------------|
| Class                   | Name                                |
|-------------------------+-------------------------------------|
| Window Manager          | [[https://hyprland.org/][Hyprland]] ðŸŒ¸                          |
| Text Editor             | [[https://www.gnu.org/software/emacs/][Emacs]] ðŸ’®                             |
| Gtk Theme               | [[https://github.com/Fausto-Korpsvart/Gruvbox-GTK-Theme][Gruvbox]] / [[https://github.com/vinceliuice/Orchis-theme][Orchis]] ðŸŽ¨                  |
| Font                    | [[https://tosche.net/fonts/comic-code][Comic Code]] / [[https://github.com/dtinth/comic-mono-font][Comic Mono]] / [[https://github.com/tonsky/FiraCode][Fira Code]] |
| Pdf Reader              | [[https://github.com/ahrm/sioyek][Sioyek]] ðŸ“” (ditch zathura)            |
| Media Player            | [[https://mpv.io][MPV!]] ðŸŽ¬ (its MVP too)                |
| Image Viewer            | [[https://sr.ht/~exec64/imv/][Imv]] ðŸ–¼ï¸                               |
| RSS Reader              | [[https://github.com/skeeto/elfeed][Elfeed]] ðŸ“° (Again, Emacs)             |
| Music Player            | [[https://github.com/ncmpcpp/ncmpcpp][Ncmpcpp]] or [[https://github.com//mingus][Mingus in Emacs]] ðŸŽ¶        |
| Terminal                | [[https://codeberg.org/dnkl/foot][Foot]] via footclient âš½               |
| Menu/Launcher           | [[https://github.com/Cloudef/bemenu][Bemenu]] ðŸš€                            |
| Notification            | [[https://github.com/dunst/dunst][Dunst]]  ðŸ›Žï¸                            |
| Shell                   | [[https://zsh.org][Zshell]] with [[https://starship.rs][Starship]] ðŸ”°              |
| Status Bar              | [[https://github.com/Alexays/Waybar][Waybar]]  ðŸ¥                           |
| Favourite Color-Schemes | Modus-Vivendi + Gruvbox             |
|-------------------------+-------------------------------------|

#+begin_quote
Rest all other stuffs I do in Emacs, tbh I could do everything in Emacs lol.
#+end_quote


Feel free to comment down and ask me doubts or about some improvements, you wanna inform! I will be glad.
