content/posts/tools-readme.md
+++
title = "Tools that are Best!"
date = 2023-03-17
tags = ["cli", "linux", "minimal", "tools"]
draft = false
+++

<div class="ox-hugo-toc toc">

<div class="heading">Table of Contents</div>

- [Utilities that are Best! ðŸŒŸ](#utilities-that-are-best)

</div>
<!--endtoc-->

---


## Utilities that are Best! ðŸŒŸ {#utilities-that-are-best}

---

| Class                   | Name                                                                                                                                                          |
|-------------------------|---------------------------------------------------------------------------------------------------------------------------------------------------------------|
| Window Manager          | [Hyprland](https://hyprland.org/) ðŸŒ¸                                                                                                                          |
| Text Editor             | [Emacs](https://www.gnu.org/software/emacs/) ðŸ’®                                                                                                               |
| Gtk Theme               | [Gruvbox](https://github.com/Fausto-Korpsvart/Gruvbox-GTK-Theme) / [Orchis](https://github.com/vinceliuice/Orchis-theme) ðŸŽ¨                                   |
| Font                    | [Comic Code](https://tosche.net/fonts/comic-code) / [Comic Mono](https://github.com/dtinth/comic-mono-font) / [Fira Code](https://github.com/tonsky/FiraCode) |
| Pdf Reader              | [Sioyek](https://github.com/ahrm/sioyek) ðŸ“” (ditch zathura)                                                                                                   |
| Media Player            | [MPV!](https://mpv.io) ðŸŽ¬ (its MVP too)                                                                                                                       |
| Image Viewer            | [Imv](https://sr.ht/~exec64/imv/) ðŸ–¼ï¸                                                                                                                           |
| RSS Reader              | [Elfeed](https://github.com/skeeto/elfeed) ðŸ“° (Again, Emacs)                                                                                                  |
| Music Player            | [Ncmpcpp](https://github.com/ncmpcpp/ncmpcpp) or [Mingus in Emacs](https://github.com//mingus) ðŸŽ¶                                                             |
| Terminal                | [Foot](https://codeberg.org/dnkl/foot) via footclient âš½                                                                                                      |
| Menu/Launcher           | [Bemenu](https://github.com/Cloudef/bemenu) ðŸš€                                                                                                                |
| Notification            | [Dunst](https://github.com/dunst/dunst)  ðŸ›Žï¸                                                                                                                    |
| Shell                   | [Zshell](https://zsh.org) with [Starship](https://starship.rs) ðŸ”°                                                                                             |
| Status Bar              | [Waybar](https://github.com/Alexays/Waybar)  ðŸ¥                                                                                                               |
| Favourite Color-Schemes | Modus-Vivendi + Gruvbox                                                                                                                                       |

> Rest all other stuffs I do in Emacs, tbh I could do everything in Emacs lol.

Feel free to comment down and ask me doubts or about some improvements, you wanna inform! I will be glad.
